{
  "backend/main.mo": "Motoko canister implementing access control, membership tiers, and user profile storage with admin‑gated CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and tests with high confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing UI components, pages, and hooks across the app.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring routing, theming, authentication, profile setup, and notification banner.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple UI screen informing unauthorized users and offering a return‑home button.",
  "frontend/src/components/AvailabilityManagementPanel.tsx": "Admin panel UI for creating 30‑minute time slots and toggling availability and live status using backend query hooks.",
  "frontend/src/components/BookingExtensionsPanel.tsx": "UI panel allowing staff to extend a booking by 15 minutes using a booking ID with validation and toast feedback.",
  "frontend/src/components/BusinessContactInfoPanel.tsx": "Form for viewing and updating business contact details fetched from and saved to the backend.",
  "frontend/src/components/InviteAdminPanel.tsx": "Panel for inviting new admins via email, messaging apps, or link sharing, with device detection and invitation tracking.",
  "frontend/src/components/Layout.tsx": "App layout with navigation, authentication handling, admin access check, and a responsive header and menu.",
  "frontend/src/components/LoyaltyPointsSettingsPanel.tsx": "Settings UI to enable or disable awarding loyalty points for promotional bookings with save functionality.",
  "frontend/src/components/MembershipManagementPanel.tsx": "CRUD interface for membership tiers allowing creation, editing, and deletion of tier data with validation.",
  "frontend/src/components/NotificationBanner.tsx": "Displays the most recent unread notification and allows dismissing it while marking it as read.",
  "frontend/src/components/NotificationCenter.tsx": "Provides a full notification panel with reading, deleting, and clearing notifications using a slide-out sheet.",
  "frontend/src/components/PointsCategoriesPanel.tsx": "Manages creation, editing, and deletion of points categories with form handling and validation.",
  "frontend/src/components/ProductManagementPanel.tsx": "Form for adding new products with validation and submission to backend via mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup, capturing name and email and saving via mutation.",
  "frontend/src/components/StripeConfigPanel.tsx": "Configures Stripe payment settings by submitting a secret key and allowed countries.",
  "frontend/src/components/VenueInfoPanel.tsx": "Form for updating venue details such as name, location, and operating hours via backend mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, persisted identities, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend data such as profiles, memberships, points, bookings, and other admin-controlled resources.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark mode CSS variables for a cricket-themed UI along with global styles and custom scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin interface with tabbed panels for managing settings, requiring authenticated admin access.",
  "frontend/src/pages/BookingPage.tsx": "Displays available time slots, lets authenticated users book sessions, and awards loyalty points based on membership and category multipliers.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, features list, and top reviews with navigation actions.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays player rankings with a podium for top three and a full leaderboard list fetched from the backend.",
  "frontend/src/pages/MembershipPage.tsx": "Shows membership details, tiers, and rewards, with checkout flow for upgrades and authentication checks.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Informs the user that their payment was cancelled and provides navigation back to store or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms a successful payment and offers links to view orders or return home.",
  "frontend/src/pages/ProfilePage.tsx": "Authenticated user profile page showing personal info, membership, bookings, and orders in tabbed sections.",
  "frontend/src/pages/ReviewsPage.tsx": "Shows user reviews and provides an authenticated form for submitting new ratings and comments.",
  "frontend/src/pages/StorePage.tsx": "Renders the store page with product listing, cart management, and checkout session creation using hooks for products and authentication. Handles adding items, updating quantities, computing totals, and initiating checkout.",
  "frontend/src/pages/VenueInfoPage.tsx": "Displays venue details, contact information, FAQs, and rules using fetched venue and business data with fallback defaults. Includes structured cards and accordion sections for user-facing info.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling custom colors, animations, container settings, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes related to booking, admin features, and contact information management."
}