{
  "backend/main.mo": "Main actor implementing access control, membership tiers, and user profile management using ordered maps with admin-restricted mutations.",
  "backend/migration.mo": "Defines old and new actor state structures for data migration across many domain modules including tiers, profiles, bookings, products, and configuration.",
  "feature_evidence.json": "Feature evidence report mapping a specific admin slots UI update to affected frontend files and related components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing all frontend files, their responsibilities, and UI behavior.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React app configuring router routes, theme provider, authentication handling, and profile setup modal logic.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen that displays an access denied message with a button to return home when a user lacks permissions.",
  "frontend/src/components/AvailabilityManagementPanel.tsx": "Admin time slot management panel enabling creation of 30‑minute slots and bulk or individual updates to availability and live visibility states.",
  "frontend/src/components/BookingExtensionsPanel.tsx": "UI for staff to extend a booking by 15 minutes using a mutation and displays success or error toasts.",
  "frontend/src/components/BusinessContactInfoPanel.tsx": "Panel to view and update business contact info with form fields synced to backend via queries and mutations.",
  "frontend/src/components/InviteAdminPanel.tsx": "Admin invitation tool that creates invitation records, composes shareable messages, and offers device-aware sharing options.",
  "frontend/src/components/Layout.tsx": "Main app layout with navigation, authentication handling, admin checks, and responsive menus.",
  "frontend/src/components/LoyaltyPointsSettingsPanel.tsx": "Settings panel allowing admins to enable or disable awarding loyalty points for promotional bookings.",
  "frontend/src/components/MembershipManagementPanel.tsx": "CRUD interface for managing membership tiers, including creation, editing, validation, and backend syncing.",
  "frontend/src/components/NotificationBanner.tsx": "Shows the most recent unread notification, allows dismissing it, and marks it as read.",
  "frontend/src/components/NotificationCenter.tsx": "Provides a sliding panel to view, mark read, and delete notifications with unread count display.",
  "frontend/src/components/PointsCategoriesPanel.tsx": "Manages creation, editing, and deletion of points categories with form validation and API mutations.",
  "frontend/src/components/ProductManagementPanel.tsx": "Form for adding new products with name, price, category, and stock, submitting them via API.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile creation, collecting name and email and saving via API.",
  "frontend/src/components/StripeConfigPanel.tsx": "Configures Stripe payment settings including secret key and allowed countries, submitting them to the backend.",
  "frontend/src/components/VenueInfoPanel.tsx": "Form to update venue details such as name, location, and hours, sending changes to the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handlers, and initializes AuthClient with stored or new identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, membership tiers, points categories, and other CRUD operations.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for a green‑and‑gold light/dark theme with UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Displays the admin dashboard with tabs for managing memberships, points, availability, products, and other venue settings.",
  "frontend/src/pages/BookingPage.tsx": "Lets authenticated users view time slots, make bookings, and see earned loyalty points with supporting UI and validations.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, feature cards, and top reviews with navigation actions.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays player leaderboard with podium for top 3 and a full ranked list from fetched data.",
  "frontend/src/pages/MembershipPage.tsx": "Shows membership details, tiers, rewards, and handles checkout for upgrades with authentication checks.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment cancellation message with navigation options back to store or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows successful payment confirmation and links to view orders or return home.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile info, membership badges, and tabs for viewing bookings and orders.",
  "frontend/src/pages/ReviewsPage.tsx": "Lists user reviews and provides a form for authenticated users to submit new ratings and comments.",
  "frontend/src/pages/StorePage.tsx": "Implements a store page that lists products by category, manages a shopping cart, and triggers checkout using a backend session API.",
  "frontend/src/pages/VenueInfoPage.tsx": "Displays venue details, contact info, FAQs, and rules using data from venue and business info APIs.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Tracks the project’s feature set, requirements, known issues, and current architectural notes for booking and admin systems."
}